## Plan Result (dev-appgateway)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.appgateway.azurerm_application_gateway.ag[0]
  * module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.appgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "aks-fe-00-dev-agw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "ss-dev-network-rg"
      + tags                        = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "darts-portal"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-casetracker"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-certificatedbailiffs"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-courtfines"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-immigrationappealsonline"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-admin-appeals"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-care-standards"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-cicap"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-employment-appeals"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-finance-tax"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-immigration-svcs"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-info-rights"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-land-reg-division"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-lands-chamber"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "dev-trib-tansport-appeals"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "jd-bureau"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "jd-public"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "portal-dev"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "sds-api-mgmt"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "toffee"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-admin-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-test-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-video-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-video-web-pr-1955"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-video-web-reform"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "darts-portal"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "darts-portal"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-casetracker"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-casetracker"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-certificatedbailiffs"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-certificatedbailiffs"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-courtfines"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-courtfines"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-immigrationappealsonline"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-immigrationappealsonline"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-admin-appeals"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-admin-appeals"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-care-standards"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-care-standards"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-cicap"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-cicap"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-employment-appeals"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-employment-appeals"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-finance-tax"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-finance-tax"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-immigration-svcs"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-immigration-svcs"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-info-rights"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-info-rights"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-land-reg-division"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-land-reg-division"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-lands-chamber"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-lands-chamber"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "dev-trib-tansport-appeals"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "dev-trib-tansport-appeals"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "portal-dev"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "portal-dev"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "sds-api-mgmt"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "sds-api-mgmt"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "toffee"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "toffee"
          + protocol      

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

    + priority                   = 120
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-immigrationappealsonline"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-immigrationappealsonline"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-immigrationappealsonline"
          + id                         = (known after apply)
          + name                       = "dev-immigrationappealsonline"
          + priority                   = 130
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-admin-appeals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-admin-appeals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-admin-appeals"
          + id                         = (known after apply)
          + name                       = "dev-trib-admin-appeals"
          + priority                   = 180
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-care-standards"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-care-standards"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-care-standards"
          + id                         = (known after apply)
          + name                       = "dev-trib-care-standards"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-cicap"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-cicap"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-cicap"
          + id                         = (known after apply)
          + name                       = "dev-trib-cicap"
          + priority                   = 240
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-employment-appeals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-employment-appeals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-employment-appeals"
          + id                         = (known after apply)
          + name                       = "dev-trib-employment-appeals"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-finance-tax"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-finance-tax"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-finance-tax"
          + id                         = (known after apply)
          + name                       = "dev-trib-finance-tax"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-immigration-svcs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-immigration-svcs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-immigration-svcs"
          + id                         = (known after apply)
          + name                       = "dev-trib-immigration-svcs"
          + priority                   = 160
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-info-rights"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-info-rights"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-info-rights"
          + id                         = (known after apply)
          + name                       = "dev-trib-info-rights"
          + priority                   = 170
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-land-reg-division"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-land-reg-division"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-land-reg-division"
          + id                         = (known after apply)
          + name                       = "dev-trib-land-reg-division"
          + priority                   = 150
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-lands-chamber"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-lands-chamber"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-lands-chamber"
          + id                         = (known after apply)
          + name                       = "dev-trib-lands-chamber"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-tansport-appeals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-tansport-appeals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-tansport-appeals"
          + id                         = (known after apply)
          + name                       = "dev-trib-tansport-appeals"
          + priority                   = 230
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "jd-bureau"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "jd-bureau"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "jd-bureau"
          + id                         = (known after apply)
          + name                       = "jd-bureau"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "jd-public"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "jd-public"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "jd-public"
          + id                         = (known after apply)
          + name                       = "jd-public"
          + priority                   = 30
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "portal-dev"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "portal-dev"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "portal-dev"
          + id                         = (known after apply)
          + name                       = "portal-dev"
          + priority                   = 90
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sds-api-mgmt"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sds-api-mgmt"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sds-api-mgmt"
          + id                         = (known after apply)
          + name                       = "sds-api-mgmt"
          + priority                   = 140
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "toffee"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "toffee"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "toffee"
          + id                         = (known after apply)
          + name                       = "toffee"
          + priority                   = 10
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-admin-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-admin-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-admin-web"
          + id                         = (known after apply)
          + name                       = "vh-admin-web"
          + priority                   = 80
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-test-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-test-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-test-web"
          + id                         = (known after apply)
          + name                       = "vh-test-web"
          + priority                   = 40
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-video-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-video-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-video-web"
          + id                         = (known after apply)
          + name                       = "vh-video-web"
          + priority                   = 50
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-video-web-pr-1955"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-video-web-pr-1955"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-video-web-pr-1955"
          + id                         = (known after apply)
          + name                       = "vh-video-web-pr-1955"
          + priority                   = 70
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-video-web-reform"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-video-web-reform"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-video-web-reform"
          + id                         = (known after apply)
          + name                       = "vh-video-web-reform"
          + priority                   = 60
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "x_fwded_proto"

          + rewrite_rule {
              + name          = "x_fwded_proto"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-Proto"
                  + header_value = "https"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Port"
                  + header_value = "443"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_add_x_forwarded_for_proxy}"
                }
            }
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }
    }

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "AppGw"
      + target_resource_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.appgateway.azurerm_application_gateway.ag[0] has been deleted
  - resource "azurerm_application_gateway" "ag" {
      - id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw" -> null
        name                              = "aks-fe-00-dev-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (7 unchanged attributes hidden)

        # (133 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":455,"Program":"tfcmt","SHA1":"","Target":"dev-appgateway","Vars":{}} -->